GreatCowBASIC/DATFileGenerator/incfiles/p18F26Q71.inc
;----- OPA2OFFSET Bits -----------------------------------------------------
OFFSET0          EQU  H'0000'
OFFSET1          EQU  H'0001'
OFFSET2          EQU  H'0002'
OFFSET3          EQU  H'0003'
OFFSET4          EQU  H'0004'
OFFSET5          EQU  H'0005'
OFFSET6          EQU  H'0006'
OFFSET7          EQU  H'0007'
OPA2OFFSET0      EQU  H'0000'
OPA2OFFSET1      EQU  H'0001'
OPA2OFFSET2      EQU  H'0002'
OPA2OFFSET3      EQU  H'0003'
OPA2OFFSET4      EQU  H'0004'
OPA2OFFSET5      EQU  H'0005'
OPA2OFFSET6      EQU  H'0006'
OPA2OFFSET7      EQU  H'0007'


;----- OPA2ORS Bits -----------------------------------------------------
ORS0             EQU  H'0000'
ORS1             EQU  H'0001'
ORS2             EQU  H'0002'
ORS3             EQU  H'0003'
ORS4             EQU  H'0004'
ORS5             EQU  H'0005'
ORS6             EQU  H'0006'
ORS7             EQU  H'0007'
OPA2ORS0         EQU  H'0000'
OPA2ORS1         EQU  H'0001'
OPA2ORS2         EQU  H'0002'
OPA2ORS3         EQU  H'0003'
OPA2ORS4         EQU  H'0004'
OPA2ORS5         EQU  H'0005'
OPA2ORS6         EQU  H'0006'
OPA2ORS7         EQU  H'0007'


;----- LATA Bits -----------------------------------------------------
LATA0            EQU  H'0000'
LATA1            EQU  H'0001'
LATA2            EQU  H'0002'
LATA3            EQU  H'0003'
LATA4            EQU  H'0004'
LATA5            EQU  H'0005'
LATA6            EQU  H'0006'
LATA7            EQU  H'0007'


;----- LATB Bits -----------------------------------------------------
LATB0            EQU  H'0000'
LATB1            EQU  H'0001'
LATB2            EQU  H'0002'
LATB3            EQU  H'0003'
LATB4            EQU  H'0004'
LATB5            EQU  H'0005'
LATB6            EQU  H'0006'
LATB7            EQU  H'0007'


;----- LATC Bits -----------------------------------------------------
LATC0            EQU  H'0000'
LATC1            EQU  H'0001'
LATC2            EQU  H'0002'
LATC3            EQU  H'0003'
LATC4            EQU  H'0004'
LATC5            EQU  H'0005'
LATC6            EQU  H'0006'
LATC7            EQU  H'0007'


;----- TRISA Bits -----------------------------------------------------
TRISA0           EQU  H'0000'
TRISA1           EQU  H'0001'
TRISA2           EQU  H'0002'
TRISA3           EQU  H'0003'
TRISA4           EQU  H'0004'
TRISA5           EQU  H'0005'
TRISA6           EQU  H'0006'
TRISA7           EQU  H'0007'


;----- TRISB Bits -----------------------------------------------------
TRISB0           EQU  H'0000'
TRISB1           EQU  H'0001'
TRISB2           EQU  H'0002'
TRISB3           EQU  H'0003'
TRISB4           EQU  H'0004'
TRISB5           EQU  H'0005'
TRISB6           EQU  H'0006'
TRISB7           EQU  H'0007'


;----- TRISC Bits -----------------------------------------------------
TRISC0           EQU  H'0000'
TRISC1           EQU  H'0001'
TRISC2           EQU  H'0002'
TRISC3           EQU  H'0003'
TRISC4           EQU  H'0004'
TRISC5           EQU  H'0005'
TRISC6           EQU  H'0006'
TRISC7           EQU  H'0007'


;----- PORTA Bits -----------------------------------------------------
RA0              EQU  H'0000'
RA1              EQU  H'0001'
RA2              EQU  H'0002'
RA3              EQU  H'0003'
RA4              EQU  H'0004'
RA5              EQU  H'0005'
RA6              EQU  H'0006'
RA7              EQU  H'0007'


;----- PORTB Bits -----------------------------------------------------
RB0              EQU  H'0000'
RB1              EQU  H'0001'
RB2              EQU  H'0002'
RB3              EQU  H'0003'
RB4              EQU  H'0004'
RB5              EQU  H'0005'
RB6              EQU  H'0006'
RB7              EQU  H'0007'


;----- PORTC Bits -----------------------------------------------------
RC0              EQU  H'0000'
RC1              EQU  H'0001'
RC2              EQU  H'0002'
RC3              EQU  H'0003'
RC4              EQU  H'0004'
RC5              EQU  H'0005'
RC6              EQU  H'0006'
RC7              EQU  H'0007'


;----- PORTE Bits -----------------------------------------------------
RE3              EQU  H'0003'


;----- APMCON Bits -----------------------------------------------------
EN               EQU  H'0007'
APMEN            EQU  H'0007'


;----- APMPRE Bits -----------------------------------------------------
PRE0             EQU  H'0000'
PRE1             EQU  H'0001'
PRE2             EQU  H'0002'
PRE3             EQU  H'0003'
PRE4             EQU  H'0004'
PRE5             EQU  H'0005'
PRE6             EQU  H'0006'
PRE7             EQU  H'0007'
APMPRE0          EQU  H'0000'
APMPRE1          EQU  H'0001'
APMPRE2          EQU  H'0002'
APMPRE3          EQU  H'0003'
APMPRE4          EQU  H'0004'
APMPRE5          EQU  H'0005'
APMPRE6          EQU  H'0006'
APMPRE7          EQU  H'0007'


;----- APMPREH Bits -----------------------------------------------------
PRE8             EQU  H'0000'
PRE9             EQU  H'0001'
PRE10            EQU  H'0002'
PRE11            EQU  H'0003'
PRE12            EQU  H'0004'
PRE13            EQU  H'0005'
PRE14            EQU  H'0006'
PRE15            EQU  H'0007'
APMPRE8          EQU  H'0000'
APMPRE9          EQU  H'0001'
APMPRE10         EQU  H'0002'
APMPRE11         EQU  H'0003'
APMPRE12         EQU  H'0004'
APMPRE13         EQU  H'0005'
APMPRE14         EQU  H'0006'
APMPRE15         EQU  H'0007'


;----- APMPER Bits -----------------------------------------------------
PER0             EQU  H'0000'
PER1             EQU  H'0001'
PER2             EQU  H'0002'
PER3             EQU  H'0003'
PER4             EQU  H'0004'
PER5             EQU  H'0005'
PER6             EQU  H'0006'
PER7             EQU  H'0007'
APMPER0          EQU  H'0000'
APMPER1          EQU  H'0001'
APMPER2          EQU  H'0002'
APMPER3          EQU  H'0003'
APMPER4          EQU  H'0004'
APMPER5          EQU  H'0005'
APMPER6          EQU  H'0006'
APMPER7          EQU  H'0007'


;----- APMPERH Bits -----------------------------------------------------
PER8             EQU  H'0000'
PER9             EQU  H'0001'
PER10            EQU  H'0002'
PER11            EQU  H'0003'
PER12            EQU  H'0004'
PER13            EQU  H'0005'
PER14            EQU  H'0006'
PER15            EQU  H'0007'
APMPER8          EQU  H'0000'
APMPER9          EQU  H'0001'
APMPER10         EQU  H'0002'
APMPER11         EQU  H'0003'
APMPER12         EQU  H'0004'
APMPER13         EQU  H'0005'
APMPER14         EQU  H'0006'
APMPER15         EQU  H'0007'


;----- APMPERS2 Bits -----------------------------------------------------
BG               EQU  H'0002'
FVR1             EQU  H'0003'
FVR2             EQU  H'0004'
ADCD             EQU  H'0005'
ADCA             EQU  H'0006'
TEMP             EQU  H'0007'
APMPERS2_2       EQU  H'0002'
APMPERS2_3       EQU  H'0003'
APMPERS2_4       EQU  H'0004'
APMPERS2_5       EQU  H'0005'
APMPERS2_6       EQU  H'0006'
APMPERS2_7       EQU  H'0007'


;----- APMPERS2H Bits -----------------------------------------------------
OPA1             EQU  H'0000'
OPA2             EQU  H'0001'
DAC1             EQU  H'0002'
DAC2             EQU  H'0003'
DAC3             EQU  H'0004'
CMP1             EQU  H'0005'
CMP2             EQU  H'0006'
ZCD              EQU  H'0007'
APMPERS2_8       EQU  H'0000'
APMPERS2_9       EQU  H'0001'
APMPERS2_10      EQU  H'0002'
APMPERS2_11      EQU  H'0003'
APMPERS2_12      EQU  H'0004'
APMPERS2_13      EQU  H'0005'
APMPERS2_14      EQU  H'0006'
APMPERS2_15      EQU  H'0007'


